-- Вариант 8, Задание 6, подпункт 14
-- 14. По каждой дисциплине, которая читается преподавателем
факультета, расположенном в одном из корпусов с 1 по 8, вывести: 
1) название дисциплины, 2) количество аудиторий, в которых эта
дисциплина читается, 3) количество занятий, которые проводятся
по этой дисциплине
В сводке выводить только те дисциплины, которые читают не
более 5 преподавателей. Результат упорядочить по третьему
столбцу по возрастанию, по второму столбцу по убыванию и
первому столбцу по убыванию. Использовать для этого
порядковые номера столбцов результирующей таблицы

-- Здесь пишем SQL-запрос
SELECT ...;
