-- Variant 2: Задание №1 - пункт 4
-- SQL (две формы, если указано)

-- Задание 1.4 (вариант 2)
-- Информация о кафедрах: "Кафедра <название кафедры> с первичным ключом <номер первичного ключа> имеет удвоенный фонд финансирования <фонд * 2>"
-- Вариант 1: всё в одном столбце
SELECT DepID,
       CONCAT('Кафедра ', Name, ' с первичным ключом ', CAST(DepID AS varchar(20)),
              ' имеет удвоенный фонд финансирования ', CAST(COALESCE(Fund,0)*2 AS varchar(20)))
       AS "Информация о кафедрах"
FROM DEPARTMENT;

-- Вариант 2: в шести столбцах
SELECT DepID,
       'Константа1' AS "Константа1",
       Name       AS "Кафедра",
       'Константа2' AS "Константа2",
       DepID      AS "Номер первичного ключа",
       'Константа3' AS "Константа3",
       (COALESCE(Fund,0)*2) AS "Финансирование"
FROM DEPARTMENT;
